; domain
(define
    (domain cube3)
    (:requirements :strips :adl :typing :conditional-effects )
    (:predicates
        (cube1 ?x ?y ?z)
        (cube2 ?x ?y ?z)
        (cube3 ?x ?y ?z)
        (cube4 ?x ?y ?z)
        (cube5 ?x ?y ?z)
        (cube6 ?x ?y ?z)
        (cube7 ?x ?y ?z)
        (cube8 ?x ?y ?z)
        (edge12 ?y ?z)
        (edge13 ?x ?z)
        (edge15 ?x ?y)
        (edge26 ?x ?y)
        (edge24 ?x ?z)
        (edge48 ?x ?y)
        (edge34 ?y ?z)
        (edge37 ?x ?y)
        (edge56 ?y ?z)
        (edge57 ?x ?z)
        (edge68 ?x ?z)
        (edge78 ?y ?z)
    )

    (:action R
    :effect
        (and
            (forall (?x ?y ?z) (when (cube5 ?x ?y ?z) (and (not (cube5 ?x ?y ?z)) (cube7 ?y ?x ?z))))
            (forall (?x ?y ?z) (when (cube7 ?x ?y ?z) (and (not (cube7 ?x ?y ?z)) (cube8 ?y ?x ?z))))
            (forall (?x ?y ?z) (when (cube8 ?x ?y ?z) (and (not (cube8 ?x ?y ?z)) (cube6 ?y ?x ?z))))
            (forall (?x ?y ?z) (when (cube6 ?x ?y ?z) (and (not (cube6 ?x ?y ?z)) (cube5 ?y ?x ?z))))

            (forall (?x ?z) (when (edge57 ?x ?z) (and (not (edge57 ?x ?z)) (edge78 ?x ?z))))
            (forall (?y ?z) (when (edge78 ?y ?z) (and (not (edge78 ?y ?z)) (edge68 ?y ?z))))
            (forall (?x ?z) (when (edge68 ?x ?z) (and (not (edge68 ?x ?z)) (edge56 ?x ?z))))
            (forall (?y ?z) (when (edge56 ?y ?z) (and (not (edge56 ?y ?z)) (edge57 ?y ?z))))

        )
    )

    (:action R2
    :effect
        (and
            (forall (?x ?y ?z) (when (cube5 ?x ?y ?z) (and (not (cube5 ?x ?y ?z)) (cube8 ?x ?y ?z))))
            (forall (?x ?y ?z) (when (cube7 ?x ?y ?z) (and (not (cube7 ?x ?y ?z)) (cube6 ?x ?y ?z))))
            (forall (?x ?y ?z) (when (cube8 ?x ?y ?z) (and (not (cube8 ?x ?y ?z)) (cube5 ?x ?y ?z))))
            (forall (?x ?y ?z) (when (cube6 ?x ?y ?z) (and (not (cube6 ?x ?y ?z)) (cube7 ?x ?y ?z))))

            (forall (?x ?z) (when (edge57 ?x ?z) (and (not (edge57 ?x ?z)) (edge68 ?x ?z))))
            (forall (?y ?z) (when (edge78 ?y ?z) (and (not (edge78 ?y ?z)) (edge56 ?y ?z))))
            (forall (?x ?z) (when (edge68 ?x ?z) (and (not (edge68 ?x ?z)) (edge57 ?x ?z))))
            (forall (?y ?z) (when (edge56 ?y ?z) (and (not (edge56 ?y ?z)) (edge78 ?y ?z))))

        )
    )

    (:action Rrev
    :effect
        (and
            (forall (?x ?y ?z) (when (cube5 ?x ?y ?z) (and (not (cube5 ?x ?y ?z)) (cube6 ?y ?x ?z))))
            (forall (?x ?y ?z) (when (cube6 ?x ?y ?z) (and (not (cube6 ?x ?y ?z)) (cube8 ?y ?x ?z))))
            (forall (?x ?y ?z) (when (cube8 ?x ?y ?z) (and (not (cube8 ?x ?y ?z)) (cube7 ?y ?x ?z))))
            (forall (?x ?y ?z) (when (cube7 ?x ?y ?z) (and (not (cube7 ?x ?y ?z)) (cube5 ?y ?x ?z))))

            (forall (?x ?z) (when (edge57 ?x ?z) (and (not (edge57 ?x ?z)) (edge56 ?x ?z))))
            (forall (?y ?z) (when (edge78 ?y ?z) (and (not (edge78 ?y ?z)) (edge57 ?y ?z))))
            (forall (?x ?z) (when (edge68 ?x ?z) (and (not (edge68 ?x ?z)) (edge78 ?x ?z))))
            (forall (?y ?z) (when (edge56 ?y ?z) (and (not (edge56 ?y ?z)) (edge68 ?y ?z))))

        )
    )

    (:action L
    :effect
        (and
            (forall (?x ?y ?z) (when (cube1 ?x ?y ?z) 
                (and (not (cube1 ?x ?y ?z)) (cube2 ?y ?x ?z))))
            (forall (?x ?y ?z) (when (cube3 ?x ?y ?z) 
                (and (not (cube3 ?x ?y ?z)) (cube1 ?y ?x ?z))))
            (forall (?x ?y ?z) (when (cube4 ?x ?y ?z) 
                (and (not (cube4 ?x ?y ?z)) (cube3 ?y ?x ?z))))
            (forall (?x ?y ?z) (when (cube2 ?x ?y ?z) 
                (and (not (cube2 ?x ?y ?z)) (cube4 ?y ?x ?z))))

            (forall (?x ?z) (when (edge13 ?x ?z) 
                (and (not (edge13 ?x ?z)) (edge12 ?x ?z))))
            (forall (?y ?z) (when (edge34 ?y ?z) 
                (and (not (edge34 ?y ?z)) (edge13 ?y ?z))))
            (forall (?x ?z) (when (edge24 ?x ?z) 
                (and (not (edge24 ?x ?z)) (edge34 ?x ?z))))
            (forall (?y ?z) (when (edge12 ?y ?z) 
                (and (not (edge12 ?y ?z)) (edge24 ?y ?z))))

        )
    )

    (:action L2
    :effect
        (and
            (forall (?x ?y ?z) (when (cube1 ?x ?y ?z) (and (not (cube1 ?x ?y ?z)) (cube4 ?x ?y ?z))))
            (forall (?x ?y ?z) (when (cube3 ?x ?y ?z) (and (not (cube3 ?x ?y ?z)) (cube2 ?x ?y ?z))))
            (forall (?x ?y ?z) (when (cube4 ?x ?y ?z) (and (not (cube4 ?x ?y ?z)) (cube1 ?x ?y ?z))))
            (forall (?x ?y ?z) (when (cube2 ?x ?y ?z) (and (not (cube2 ?x ?y ?z)) (cube3 ?x ?y ?z))))

            (forall (?x ?z) (when (edge13 ?x ?z) (and (not (edge13 ?x ?z)) (edge24 ?x ?z))))
            (forall (?y ?z) (when (edge34 ?y ?z) (and (not (edge34 ?y ?z)) (edge12 ?y ?z))))
            (forall (?x ?z) (when (edge24 ?x ?z) (and (not (edge24 ?x ?z)) (edge13 ?x ?z))))
            (forall (?y ?z) (when (edge12 ?y ?z) (and (not (edge12 ?y ?z)) (edge34 ?y ?z))))

        )
    )

    (:action Lrev
    :effect
        (and
            (forall (?x ?y ?z) (when (cube1 ?x ?y ?z) (and (not (cube1 ?x ?y ?z)) (cube3 ?y ?x ?z))))
            (forall (?x ?y ?z) (when (cube3 ?x ?y ?z) (and (not (cube3 ?x ?y ?z)) (cube4 ?y ?x ?z))))
            (forall (?x ?y ?z) (when (cube4 ?x ?y ?z) (and (not (cube4 ?x ?y ?z)) (cube2 ?y ?x ?z))))
            (forall (?x ?y ?z) (when (cube2 ?x ?y ?z) (and (not (cube2 ?x ?y ?z)) (cube1 ?y ?x ?z))))

            (forall (?x ?z) (when (edge13 ?x ?z) (and (not (edge13 ?x ?z)) (edge34 ?x ?z))))
            (forall (?y ?z) (when (edge34 ?y ?z) (and (not (edge34 ?y ?z)) (edge24 ?y ?z))))
            (forall (?x ?z) (when (edge24 ?x ?z) (and (not (edge24 ?x ?z)) (edge12 ?x ?z))))
            (forall (?y ?z) (when (edge12 ?y ?z) (and (not (edge12 ?y ?z)) (edge13 ?y ?z))))

        )
    )

    (:action D
    :effect
        (and
            (forall (?x ?y ?z) (when (cube2 ?x ?y ?z) (and (not (cube2 ?x ?y ?z)) (cube6 ?x ?z ?y))))
            (forall (?x ?y ?z) (when (cube6 ?x ?y ?z) (and (not (cube6 ?x ?y ?z)) (cube8 ?x ?z ?y))))
            (forall (?x ?y ?z) (when (cube8 ?x ?y ?z) (and (not (cube8 ?x ?y ?z)) (cube4 ?x ?z ?y))))
            (forall (?x ?y ?z) (when (cube4 ?x ?y ?z) (and (not (cube4 ?x ?y ?z)) (cube2 ?x ?z ?y))))

            (forall (?x ?y) (when (edge26 ?x ?y) (and (not (edge26 ?x ?y)) (edge68 ?x ?y))))
            (forall (?x ?z) (when (edge68 ?x ?z) (and (not (edge68 ?x ?z)) (edge48 ?x ?z))))
            (forall (?x ?y) (when (edge48 ?x ?y) (and (not (edge48 ?x ?y)) (edge24 ?x ?y))))
            (forall (?x ?z) (when (edge24 ?x ?z) (and (not (edge24 ?x ?z)) (edge26 ?x ?z))))

        )
    )

    (:action D2
    :effect
        (and
            (forall (?x ?y ?z) (when (cube2 ?x ?y ?z) (and (not (cube2 ?x ?y ?z)) (cube8 ?x ?y ?z))))
            (forall (?x ?y ?z) (when (cube6 ?x ?y ?z) (and (not (cube6 ?x ?y ?z)) (cube4 ?x ?y ?z))))
            (forall (?x ?y ?z) (when (cube8 ?x ?y ?z) (and (not (cube8 ?x ?y ?z)) (cube2 ?x ?y ?z))))
            (forall (?x ?y ?z) (when (cube4 ?x ?y ?z) (and (not (cube4 ?x ?y ?z)) (cube6 ?x ?y ?z))))

            (forall (?x ?y) (when (edge26 ?x ?y) (and (not (edge26 ?x ?y)) (edge48 ?x ?y))))
            (forall (?x ?z) (when (edge68 ?x ?z) (and (not (edge68 ?x ?z)) (edge24 ?x ?z))))
            (forall (?x ?y) (when (edge48 ?x ?y) (and (not (edge48 ?x ?y)) (edge26 ?x ?y))))
            (forall (?x ?z) (when (edge24 ?x ?z) (and (not (edge24 ?x ?z)) (edge68 ?x ?z))))

        )
    )

    (:action Drev
    :effect
        (and
            (forall (?x ?y ?z) (when (cube2 ?x ?y ?z) (and (not (cube2 ?x ?y ?z)) (cube4 ?x ?z ?y))))
            (forall (?x ?y ?z) (when (cube4 ?x ?y ?z) (and (not (cube4 ?x ?y ?z)) (cube8 ?x ?z ?y))))
            (forall (?x ?y ?z) (when (cube8 ?x ?y ?z) (and (not (cube8 ?x ?y ?z)) (cube6 ?x ?z ?y))))
            (forall (?x ?y ?z) (when (cube6 ?x ?y ?z) (and (not (cube6 ?x ?y ?z)) (cube2 ?x ?z ?y))))

            (forall (?x ?y) (when (edge26 ?x ?y) (and (not (edge26 ?x ?y)) (edge24 ?x ?y))))
            (forall (?x ?z) (when (edge68 ?x ?z) (and (not (edge68 ?x ?z)) (edge26 ?x ?z))))
            (forall (?x ?y) (when (edge48 ?x ?y) (and (not (edge48 ?x ?y)) (edge68 ?x ?y))))
            (forall (?x ?z) (when (edge24 ?x ?z) (and (not (edge24 ?x ?z)) (edge48 ?x ?z))))
        )
    )

    (:action U
    :effect
        (and
            (forall (?x ?y ?z) (when (cube1 ?x ?y ?z) (and (not (cube1 ?x ?y ?z)) (cube3 ?x ?z ?y))))
            (forall (?x ?y ?z) (when (cube5 ?x ?y ?z) (and (not (cube5 ?x ?y ?z)) (cube1 ?x ?z ?y))))
            (forall (?x ?y ?z) (when (cube7 ?x ?y ?z) (and (not (cube7 ?x ?y ?z)) (cube5 ?x ?z ?y))))
            (forall (?x ?y ?z) (when (cube3 ?x ?y ?z) (and (not (cube3 ?x ?y ?z)) (cube7 ?x ?z ?y))))

            (forall (?x ?y) (when (edge15 ?x ?y) (and (not (edge15 ?x ?y)) (edge13 ?x ?y))))
            (forall (?x ?z) (when (edge57 ?x ?z) (and (not (edge57 ?x ?z)) (edge15 ?x ?z))))
            (forall (?x ?y) (when (edge37 ?x ?y) (and (not (edge37 ?x ?y)) (edge57 ?x ?y))))
            (forall (?x ?z) (when (edge13 ?x ?z) (and (not (edge13 ?x ?z)) (edge37 ?x ?z))))
        )
    )

    (:action U2
    :effect
        (and
            (forall (?x ?y ?z) (when (cube1 ?x ?y ?z) (and (not (cube1 ?x ?y ?z)) (cube7 ?x ?y ?z))))
            (forall (?x ?y ?z) (when (cube5 ?x ?y ?z) (and (not (cube5 ?x ?y ?z)) (cube3 ?x ?y ?z))))
            (forall (?x ?y ?z) (when (cube7 ?x ?y ?z) (and (not (cube7 ?x ?y ?z)) (cube1 ?x ?y ?z))))
            (forall (?x ?y ?z) (when (cube3 ?x ?y ?z) (and (not (cube3 ?x ?y ?z)) (cube5 ?x ?y ?z))))

            (forall (?x ?y) (when (edge15 ?x ?y) (and (not (edge15 ?x ?y)) (edge37 ?x ?y))))
            (forall (?x ?z) (when (edge57 ?x ?z) (and (not (edge57 ?x ?z)) (edge13 ?x ?z))))
            (forall (?x ?y) (when (edge37 ?x ?y) (and (not (edge37 ?x ?y)) (edge15 ?x ?y))))
            (forall (?x ?z) (when (edge13 ?x ?z) (and (not (edge13 ?x ?z)) (edge57 ?x ?z))))
        )
    )

    (:action Urev
    :effect
        (and
            (forall (?x ?y ?z) (when (cube1 ?x ?y ?z) (and (not (cube1 ?x ?y ?z)) (cube5 ?x ?z ?y))))
            (forall (?x ?y ?z) (when (cube5 ?x ?y ?z) (and (not (cube5 ?x ?y ?z)) (cube7 ?x ?z ?y))))
            (forall (?x ?y ?z) (when (cube7 ?x ?y ?z) (and (not (cube7 ?x ?y ?z)) (cube3 ?x ?z ?y))))
            (forall (?x ?y ?z) (when (cube3 ?x ?y ?z) (and (not (cube3 ?x ?y ?z)) (cube1 ?x ?z ?y))))

            (forall (?x ?y) (when (edge15 ?x ?y) (and (not (edge15 ?x ?y)) (edge57 ?x ?y))))
            (forall (?x ?z) (when (edge57 ?x ?z) (and (not (edge57 ?x ?z)) (edge37 ?x ?z))))
            (forall (?x ?y) (when (edge37 ?x ?y) (and (not (edge37 ?x ?y)) (edge13 ?x ?y))))
            (forall (?x ?z) (when (edge13 ?x ?z) (and (not (edge13 ?x ?z)) (edge15 ?x ?z))))
        )
    )

    (:action F
    :effect
        (and
            (forall (?x ?y ?z) (when (cube1 ?x ?y ?z) (and (not (cube1 ?x ?y ?z)) (cube5 ?z ?y ?x) )))
            (forall (?x ?y ?z) (when (cube5 ?x ?y ?z) (and (not (cube5 ?x ?y ?z)) (cube6 ?z ?y ?x) )))
            (forall (?x ?y ?z) (when (cube6 ?x ?y ?z) (and (not (cube6 ?x ?y ?z)) (cube2 ?z ?y ?x) )))
            (forall (?x ?y ?z) (when (cube2 ?x ?y ?z) (and (not (cube2 ?x ?y ?z)) (cube1 ?z ?y ?x) )))

            (forall (?x ?y) (when (edge15 ?x ?y) (and (not (edge15 ?x ?y)) (edge56 ?y ?x))))
            (forall (?y ?z) (when (edge56 ?y ?z) (and (not (edge56 ?y ?z)) (edge26 ?z ?y))))
            (forall (?x ?y) (when (edge26 ?x ?y) (and (not (edge26 ?x ?y)) (edge12 ?y ?x))))
            (forall (?y ?z) (when (edge12 ?y ?z) (and (not (edge12 ?y ?z)) (edge15 ?z ?y))))

        )
    )

    (:action F2
    :effect
        (and
            (forall (?x ?y ?z) (when (cube1 ?x ?y ?z) (and (not (cube1 ?x ?y ?z)) (cube6 ?x ?y ?z) )))
            (forall (?x ?y ?z) (when (cube5 ?x ?y ?z) (and (not (cube5 ?x ?y ?z)) (cube2 ?x ?y ?z) )))
            (forall (?x ?y ?z) (when (cube6 ?x ?y ?z) (and (not (cube6 ?x ?y ?z)) (cube1 ?x ?y ?z) )))
            (forall (?x ?y ?z) (when (cube2 ?x ?y ?z) (and (not (cube2 ?x ?y ?z)) (cube5 ?x ?y ?z) )))

            (forall (?x ?y) (when (edge15 ?x ?y) (and (not (edge15 ?x ?y)) (edge26 ?x ?y))))
            (forall (?y ?z) (when (edge56 ?y ?z) (and (not (edge56 ?y ?z)) (edge12 ?y ?z))))
            (forall (?x ?y) (when (edge26 ?x ?y) (and (not (edge26 ?x ?y)) (edge15 ?x ?y))))
            (forall (?y ?z) (when (edge12 ?y ?z) (and (not (edge12 ?y ?z)) (edge56 ?y ?z))))

        )
    )

    (:action Frev
    :effect
        (and
            (forall (?x ?y ?z) (when (cube1 ?x ?y ?z) (and (not (cube1 ?x ?y ?z)) (cube2 ?z ?y ?x) )))
            (forall (?x ?y ?z) (when (cube2 ?x ?y ?z) (and (not (cube2 ?x ?y ?z)) (cube6 ?z ?y ?x) )))
            (forall (?x ?y ?z) (when (cube6 ?x ?y ?z) (and (not (cube6 ?x ?y ?z)) (cube5 ?z ?y ?x) )))
            (forall (?x ?y ?z) (when (cube5 ?x ?y ?z) (and (not (cube5 ?x ?y ?z)) (cube1 ?z ?y ?x) )))

            (forall (?x ?y) (when (edge15 ?x ?y) (and (not (edge15 ?x ?y)) (edge12 ?y ?x))))
            (forall (?y ?z) (when (edge56 ?y ?z) (and (not (edge56 ?y ?z)) (edge15 ?z ?y))))
            (forall (?x ?y) (when (edge26 ?x ?y) (and (not (edge26 ?x ?y)) (edge56 ?y ?x))))
            (forall (?y ?z) (when (edge12 ?y ?z) (and (not (edge12 ?y ?z)) (edge26 ?z ?y))))

        )
    )

    (:action B
    :effect
        (and
            (forall (?x ?y ?z) (when (cube3 ?x ?y ?z) (and (not (cube3 ?x ?y ?z)) (cube4 ?z ?y ?x) )))
            (forall (?x ?y ?z) (when (cube7 ?x ?y ?z) (and (not (cube7 ?x ?y ?z)) (cube3 ?z ?y ?x) )))
            (forall (?x ?y ?z) (when (cube8 ?x ?y ?z) (and (not (cube8 ?x ?y ?z)) (cube7 ?z ?y ?x) )))
            (forall (?x ?y ?z) (when (cube4 ?x ?y ?z) (and (not (cube4 ?x ?y ?z)) (cube8 ?z ?y ?x) )))

            (forall (?x ?y) (when (edge37 ?x ?y) (and (not (edge37 ?x ?y)) (edge34 ?y ?x))))
            (forall (?y ?z) (when (edge78 ?y ?z) (and (not (edge78 ?y ?z)) (edge37 ?z ?y))))
            (forall (?x ?y) (when (edge48 ?x ?y) (and (not (edge48 ?x ?y)) (edge78 ?y ?x))))
            (forall (?y ?z) (when (edge34 ?y ?z) (and (not (edge34 ?y ?z)) (edge48 ?z ?y))))
        )
    )

    (:action B2
    :effect
        (and
            (forall (?x ?y ?z) (when (cube3 ?x ?y ?z) (and (not (cube3 ?x ?y ?z)) (cube8 ?x ?y ?z) )))
            (forall (?x ?y ?z) (when (cube7 ?x ?y ?z) (and (not (cube7 ?x ?y ?z)) (cube4 ?x ?y ?z) )))
            (forall (?x ?y ?z) (when (cube8 ?x ?y ?z) (and (not (cube8 ?x ?y ?z)) (cube3 ?x ?y ?z) )))
            (forall (?x ?y ?z) (when (cube4 ?x ?y ?z) (and (not (cube4 ?x ?y ?z)) (cube7 ?x ?y ?z) )))

            (forall (?x ?y) (when (edge37 ?x ?y) (and (not (edge37 ?x ?y)) (edge48 ?x ?y))))
            (forall (?y ?z) (when (edge78 ?y ?z) (and (not (edge78 ?y ?z)) (edge34 ?y ?z))))
            (forall (?x ?y) (when (edge48 ?x ?y) (and (not (edge48 ?x ?y)) (edge37 ?x ?y))))
            (forall (?y ?z) (when (edge34 ?y ?z) (and (not (edge34 ?y ?z)) (edge78 ?y ?z))))
        )
    )

    (:action Brev
    :effect
        (and
            (forall (?x ?y ?z) (when (cube3 ?x ?y ?z) (and (not (cube3 ?x ?y ?z)) (cube7 ?z ?y ?x) )))
            (forall (?x ?y ?z) (when (cube7 ?x ?y ?z) (and (not (cube7 ?x ?y ?z)) (cube8 ?z ?y ?x) )))
            (forall (?x ?y ?z) (when (cube8 ?x ?y ?z) (and (not (cube8 ?x ?y ?z)) (cube4 ?z ?y ?x) )))
            (forall (?x ?y ?z) (when (cube4 ?x ?y ?z) (and (not (cube4 ?x ?y ?z)) (cube3 ?z ?y ?x) )))

            (forall (?x ?y) (when (edge37 ?x ?y) (and (not (edge37 ?x ?y)) (edge78 ?y ?x))))
            (forall (?y ?z) (when (edge78 ?y ?z) (and (not (edge78 ?y ?z)) (edge48 ?z ?y))))
            (forall (?x ?y) (when (edge48 ?x ?y) (and (not (edge48 ?x ?y)) (edge34 ?y ?x))))
            (forall (?y ?z) (when (edge34 ?y ?z) (and (not (edge34 ?y ?z)) (edge37 ?z ?y))))
        )
    )

)

; problem
(define
    (problem problem_11_2)
    (:domain cube3)
    (:objects Y W B G O R)
    (:init
 (cube1 O G Y)
(cube2 W O G)
(cube3 R W G)
(cube4 Y G R)
(cube5 Y O B)
(cube6 R W B)
(cube7 B W O)
(cube8 Y B R)
(edge12 Y R)
(edge13 O W)
(edge15 W G)
(edge24 W B)
(edge26 B O)
(edge34 Y G)
(edge37 B R)
(edge48 O G)
(edge56 R G)
(edge57 Y B)
(edge68 Y O)
(edge78 R W)
        
    )
    (:goal
        (and
            (cube1 R W B)
            (cube2 O W B)
            (cube3 R Y B)
            (cube4 O Y B)
            (cube5 R W G)
            (cube6 O W G)
            (cube7 R Y G)
            (cube8 O Y G)

            (edge12 W B)
            (edge24 O B)
            (edge34 Y B)
            (edge13 R B)

            (edge15 R W)
            (edge26 O W)
            (edge48 O Y)
            (edge37 R Y)

            (edge56 W G)
            (edge68 O G)
            (edge78 Y G)
            (edge57 R G)
 
        )
    )
)

; plan
1. (u)
   deleted: (cube1 o g y) (cube5 y o b) (cube7 b w o) (cube3 r w g) (edge15 w g) (edge57 y b) (edge37 b r) (edge13 o w)
   added: (cube3 o y g) (cube1 y b o) (cube5 b o w) (cube7 r g w) (edge13 w g) (edge15 y b) (edge57 b r) (edge37 o w)
   goals met: 0 of 20
2. (frev)
   deleted: (cube1 y b o) (cube2 w o g) (cube6 r w b) (cube5 b o w) (edge15 y b) (edge56 r g) (edge26 b o) (edge12 y r)
   added: (cube2 o b y) (cube6 g o w) (cube5 b w r) (cube1 w o b) (edge12 b y) (edge15 g r) (edge56 o b) (edge26 r y)
   goals met: 0 of 20
3. (rrev)
   deleted: (cube5 b w r) (cube6 g o w) (cube8 y b r) (cube7 r g w) (edge57 b r) (edge78 r w) (edge68 y o) (edge56 o b)
   added: (cube6 w b r) (cube8 o g w) (cube7 b y r) (cube5 g r w) (edge56 b r) (edge57 r w) (edge78 y o) (edge68 o b)
   goals met: 0 of 20
4. (l)
   deleted: (cube1 w o b) (cube3 o y g) (cube4 y g r) (cube2 o b y) (edge13 w g) (edge34 y g) (edge24 w b) (edge12 b y)
   added: (cube2 o w b) (cube1 y o g) (cube3 g y r) (cube4 b o y) (edge12 w g) (edge13 y g) (edge34 w b) (edge24 b y)
   goals met: 1 of 20
5. (l)
   deleted: (cube1 y o g) (cube3 g y r) (cube4 b o y) (cube2 o w b) (edge13 y g) (edge34 w b) (edge24 b y) (edge12 w g)
   added: (cube2 o y g) (cube1 y g r) (cube3 o b y) (cube4 w o b) (edge12 y g) (edge13 w b) (edge34 b y) (edge24 w g)
   goals met: 0 of 20
6. (frev)
   deleted: (cube1 y g r) (cube2 o y g) (cube6 w b r) (cube5 g r w) (edge15 g r) (edge56 b r) (edge26 r y) (edge12 y g)
   added: (cube2 r g y) (cube6 g y o) (cube5 r b w) (cube1 w r g) (edge12 r g) (edge15 r b) (edge56 y r) (edge26 g y)
   goals met: 0 of 20
7. (l)
   deleted: (cube1 w r g) (cube3 o b y) (cube4 w o b) (cube2 r g y) (edge13 w b) (edge34 b y) (edge24 w g) (edge12 r g)
   added: (cube2 r w g) (cube1 b o y) (cube3 o w b) (cube4 g r y) (edge12 w b) (edge13 b y) (edge34 w g) (edge24 r g)
   goals met: 1 of 20
8. (b)
   deleted: (cube3 o w b) (cube7 b y r) (cube8 o g w) (cube4 g r y) (edge37 o w) (edge78 y o) (edge48 o g) (edge34 w g)
   added: (cube4 b w o) (cube3 r y b) (cube7 w g o) (cube8 y r g) (edge34 w o) (edge37 o y) (edge78 g o) (edge48 g w)
   goals met: 2 of 20
9. (b)
   deleted: (cube3 r y b) (cube7 w g o) (cube8 y r g) (cube4 b w o) (edge37 o y) (edge78 g o) (edge48 g w) (edge34 w o)
   added: (cube4 b y r) (cube3 o g w) (cube7 g r y) (cube8 o w b) (edge34 y o) (edge37 o g) (edge78 w g) (edge48 o w)
   goals met: 1 of 20
10. (drev)
   deleted: (cube2 r w g) (cube4 b y r) (cube8 o w b) (cube6 g y o) (edge26 g y) (edge68 o b) (edge48 o w) (edge24 r g)
   added: (cube4 r g w) (cube8 b r y) (cube6 o b w) (cube2 g o y) (edge24 g y) (edge26 o b) (edge68 o w) (edge48 r g)
   goals met: 1 of 20
11. (drev)
   deleted: (cube2 g o y) (cube4 r g w) (cube8 b r y) (cube6 o b w) (edge26 o b) (edge68 o w) (edge48 r g) (edge24 g y)
   added: (cube4 g y o) (cube8 r w g) (cube6 b y r) (cube2 o w b) (edge24 o b) (edge26 o w) (edge68 r g) (edge48 g y)
   goals met: 4 of 20
12. (u)
   deleted: (cube1 b o y) (cube5 r b w) (cube7 g r y) (cube3 o g w) (edge15 r b) (edge57 r w) (edge37 o g) (edge13 b y)
   added: (cube3 b y o) (cube1 r w b) (cube5 g y r) (cube7 o w g) (edge13 r b) (edge15 r w) (edge57 o g) (edge37 b y)
   goals met: 7 of 20
13. (rrev)
   deleted: (cube5 g y r) (cube6 b y r) (cube8 r w g) (cube7 o w g) (edge57 o g) (edge78 w g) (edge68 r g) (edge56 y r)
   added: (cube6 y g r) (cube8 y b r) (cube7 w r g) (cube5 w o g) (edge56 o g) (edge57 w g) (edge78 r g) (edge68 y r)
   goals met: 7 of 20
14. (rrev)
   deleted: (cube5 w o g) (cube6 y g r) (cube8 y b r) (cube7 w r g) (edge57 w g) (edge78 r g) (edge68 y r) (edge56 o g)
   added: (cube6 o w g) (cube8 g y r) (cube7 b y r) (cube5 r w g) (edge56 w g) (edge57 r g) (edge78 y r) (edge68 o g)
   goals met: 12 of 20
15. (b)
   deleted: (cube3 b y o) (cube7 b y r) (cube8 g y r) (cube4 g y o) (edge37 b y) (edge78 y r) (edge48 g y) (edge34 y o)
   added: (cube4 o y b) (cube3 r y b) (cube7 r y g) (cube8 o y g) (edge34 y b) (edge37 r y) (edge78 y g) (edge48 o y)
   goals met: 20 of 20
